app/controllers/clientes_controller.rb

SELECT "vendedors".* FROM "vendedors" INNER JOIN "vens" ON "vendedors"."id" = "vens"."vendedor_id" WHERE "vens"."cliente_id" = ?  [["cliente_id", 3]]
SELECT "productos".* FROM "productos" INNER JOIN "vens" ON "productos"."id" = "vens"."producto_id" WHERE "vens"."cliente_id" = ?  [["cliente_id", 1]]
---
  def show
@vendedors = @cliente.vendedor.all
@productos = @cliente.producto.all

INSERT INTO "clientes" ("apellidoM", "comuna", "created_at", "nombre", "rut", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["apellidoM", ""], ["comuna", ""], ["created_at", "2015-10-30 00:11:49.151938"], ["nombre", ""], ["rut", ""], ["updated_at", "2015-10-30 00:11:49.151938"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
  if @cliente.valid?
      if @cliente.save