app/controllers/productos_controller.rb

  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("codigo", "created_at", "empresa_id", "nombre", "tipo", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?, ?)  [["codigo", "sas"], ["created_at", "2015-10-21 00:48:44.671739"], ["empresa_id", 1], ["nombre", "aas"], ["tipo", "sss"], ["updated_at", "2015-10-21 00:48:44.671739"], ["valor", 14]]

  def destroy
    @producto.destroy
---
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 1]]

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos"  WHERE "productos"."id" = ? LIMIT 1  [["id", 4]]